In [1]:
import pandas as pd
import numpy as np
np.set_printoptions(suppress=True)

In [2]:
#sorting lexicographically by row or column label: use sort_index method
obj = pd.Series(np.arange(4.), index=['d', 'a', 'b', 'c'])
obj #returns a new, sorted object

d    0.0
a    1.0
b    2.0
c    3.0
dtype: float64

In [3]:
obj.sort_index()

a    1.0
b    2.0
c    3.0
d    0.0
dtype: float64

In [4]:
#same as above
obj.sort_index(axis=0)

a    1.0
b    2.0
c    3.0
d    0.0
dtype: float64

In [5]:
#same as above
obj.sort_index(axis='rows')

a    1.0
b    2.0
c    3.0
d    0.0
dtype: float64

In [6]:
#with DataFrame objects, we can sort an index on rows or columns
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                    index=['three', 'one'],
                    columns=['d', 'a', 'b', 'c'])

In [7]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [8]:
#sort rows lexicographically based on rows
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [9]:
#sort rows lexicographically based on rows in another way with axis=0
frame.sort_index(axis=0)

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [10]:
#sort rows lexicographically another way with axis='rows'
frame.sort_index(axis='rows')

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [11]:
#sort rows in descending order
frame.sort_index(axis='rows', ascending=False)

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [12]:
#Although it is redundant, we can use the "ascending=True" argument
frame.sort_index(axis='rows', ascending=True)

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [13]:
#sort columns lexicographically
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [14]:
#sort columns lexicograhically another way with axis='columns'
frame.sort_index(axis='columns')

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [15]:
#sort columns in reversed order with ascending=False
frame.sort_index(axis='columns', ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [16]:
#Redundant but we can specify that ascending=True also
frame.sort_index(axis='columns', ascending=True)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [17]:
#sorting a series by its values
#use the s.sort_values() method
obj = pd.Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [18]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [19]:
#reverse the order
obj.sort_values(ascending=False)

1    7
0    4
3    2
2   -3
dtype: int64

In [20]:
#get the index of the values in order by using argsort
obj.argsort()

0    2
1    3
2    0
3    1
dtype: int64

In [21]:
#missing values: sorted to the end of the series by default
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [22]:
#Default: missing values at the end of the series
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [23]:
#na_position option: lets us specify the position of na_values
obj.sort_values(na_position='first')

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [24]:
obj.sort_values(na_position='last')

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [25]:
#columns to use as sort keys: single column or multiple columns
#1) create dataframe
frame=pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [27]:
#sort values by a single column ('b')
frame.sort_values('b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [28]:
#sort values by a single column ('a')
frame.sort_values('a')

   b  a
0  4  0
2 -3  0
1  7  1
3  2  1

In [29]:
#sorting by multiple columns
frame.sort_values(['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [30]:
#sort by multiple columns in the other order
frame.sort_values(['b', 'a'])

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [34]:
#we can also pass a list as a single value
frame.sort_values(['b'])

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [59]:
#sort_values(ascending=True) is redundant but we will use it here
frame.sort_values('a', ascending=True)

   b  a
0  4  0
2 -3  0
1  7  1
3  2  1

In [61]:
#sort_values(ascending=False) #sort in descending order 
frame.sort_values('a', ascending=False)

   b  a
1  7  1
3  2  1
0  4  0
2 -3  0

In [65]:
#practical example using christmas orders

In [66]:
pd.DataFrame({'customer': ['Martha', 'Martha', 'Katie', 'Katie'],
             'item': ['Vegetable Spring Rolls', 'Vegetable Lo Mein', 'Broccoli w/Garlic Sauce',
                     'Bean curd w/ mixed vegetables'],
             'quantity': [1, 1, 1, 1]})

  customer                           item  quantity
0   Martha         Vegetable Spring Rolls         1
1   Martha              Vegetable Lo Mein         1
2    Katie        Broccoli w/Garlic Sauce         1
3    Katie  Bean curd w/ mixed vegetables         1